selfservice/src/main/resources/lmngqueries/lmngSoapFetchMessage.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:adr="http://www.w3.org/2005/08/addressing" xmlns:sur="http://Surfmarket.CRMProxyService">
  <soap:Header>
      <adr:MessageID>urn:uuid:%UID%</adr:MessageID>
      <adr:ReplyTo>
         <adr:Address>http://www.w3.org/2005/08/addressing/anonymous</adr:Address>
      </adr:ReplyTo>
      <adr:To s:mustUnderstand="1" xmlns:s="s">%ENDPOINT%</adr:To>
      <adr:Action>http://Surfmarket.CRMProxyService/ICrmService/GetData</adr:Action></soap:Header>
  <soap:Body>
    <sur:GetData>
      <sur:InputXml>
        	%FETCH_QUERY%
      </sur:InputXml>
    </sur:GetData>
  </soap:Body>
</soap:Envelope>
